{
  "name": "Ayanava Dutta",
  "title": "AI • Data Engineering • ML Systems",
  "email": "ayanava1999@gmail.com",
  "phone": "+91-9556386605",
  "githubUsername": "ayanava99",
  "githubUrl": "https://github.com/ayanava99",
  "linkedinUrl": "https://www.linkedin.com/in/ayanava-99",
  "youtubeUrl": "",
  "experience": [
    {
      "company": "PricewaterhouseCoopers (PwC)",
      "title": "Associate 2 – Data and Analytics",
      "location": "Bangalore, KA",
      "dates": "Sep 2021 – Jun 2023",
      "bullets": [
        "Owned technical delivery for a 12-person squad to automate data cleaning workflows, cutting pipeline processing time and lowering Azure ETL run-costs through targeted optimizations.",
        "Designed and shipped a reusable Pandas transformation package to standardize ingestion/cleanup across heterogeneous file formats; improved code reuse and reduced repeated implementation effort across teams.",
        "Built and operated high-volume ETL pipelines for SAP ECC → S/4HANA migration (batch + validation), sustaining daily processing at scale with zero downtime and predictable recoverability.",
        "Implemented robust PL/SQL validation procedures and reconciliation checks across complex relational tables and legacy systems, raising data integrity and auditability for downstream consumers.",
        "Modernized a legacy analytics codebase by introducing CI/CD patterns and refactoring high-risk modules to improve maintainability, reduce regressions, and speed up releases."
      ]
    },
    {
      "company": "Highradius",
      "title": "Data Science Intern",
      "location": "Bhubaneswar, OD",
      "dates": "Apr 2020 – Jul 2021",
      "bullets": [
        "Developed and deployed remittance prediction models to production; automated manual investigation workflows and improved decision latency for operations teams.",
        "Performed recurring model analytics (accuracy, drift signals, and error breakdowns) for remittance prediction and mismatch detection to identify bottlenecks and prioritize fixes.",
        "Built monitoring + retraining pipelines to sustain model quality over time and reduce performance regressions in production.",
        "Led a 4-member effort to architect and deliver a Dockerized web application, improving environment consistency and reducing deploy time.",
        "Shipped an intelligent image gallery feature that eliminated the majority of manual review effort across multiple teams by surfacing the right artifacts at the right time.",
        "Built a full-stack B2B cloud application integrating a Dialogflow chatbot to handle high daily query volume with reliable routing and fallback behavior."
      ]
    }
  ],
  "projectsFromResume": [
    "ML Model Analyser (Python, Streamlit, LLM) — drift detection, health scoring, auto-generated fixes.",
    "Exam Seating & Attendance Generator (Python, Streamlit, Docker) — clash detection, room allocation, dynamic attendance sheets."
  ],
  "skills": [
    { "name": "Languages", "items": ["Python", "C++", "C"] },
    { "name": "Frameworks", "items": ["Pandas", "Scikit-learn", "FastAPI", "Streamlit"] },
    { "name": "Cloud & DevOps", "items": ["Azure (Databricks)", "Docker", "Git"] },
    { "name": "Databases", "items": ["Oracle PL/SQL"] }
  ],
  "certifications": [
    "Microsoft Certified: Azure AI Engineer Associate (AI-102)",
    "Microsoft Certified: Azure Data Scientist (DP-100)",
    "AWS Certified Cloud Practitioner"
  ],
  "education": [
    {
      "school": "Indian Institute of Technology Patna",
      "degree": "M.Tech in Artificial Intelligence",
      "cgpa": "CGPA: 8.09",
      "location": "Patna, BR",
      "dates": "2025 – 2027"
    },
    {
      "school": "Kalinga Institute of Industrial Technology",
      "degree": "B.Tech in Computer Science and Systems Engineering",
      "cgpa": "CGPA: 7.76",
      "location": "Bhubaneswar, OD",
      "dates": "2017 – 2021"
    }
  ]
}
